# SetAllOverrides Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyleOverrideOptions..::..SetAllOverrides Method
TableCellStyleOverrideOptions Class See Also
---
Sets all overrides to a specific value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetAllOverrides(
	bool bOverride
)
```

Visual Basic
---
```text
Public Sub SetAllOverrides ( _
	bOverride As Boolean _
)
```

Visual C++
---
```text
public:
void SetAllOverrides(
	bool bOverride
)
```

# ### Parameters
bOverride
    Type: System..::..Boolean The value that will be assigned to all the overrides.
# See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace